/*Выполнил:    Максим Цалюк
 Группа:    iOS 19-2
 Дата сдачи:    02.01.2020
 Номер задания: 19
 Текст задания:
 Создать приложение с корневым вью, на котором будут расположены следующие компоненты:
 
 - Кнопка перехода на “Пропорциональные прямоугольники” (из задания 17.1)
 
 - Текстовые поля RGB, Кнопка перехода на вью контроллер со слайдерами (из задания 18)
 
 Что важно учесть:
 1) (1 балл) переход на разные Вью контроллеры из корневого
 2) (1 балл) Тайтлы у всех контроллеров
 3) (2 балла) pop программно на предыдущий ViewController, pop на корневой ViewController
 4) (3 балла ) Передача параметров из корневого вью контроллера в последующий. Значения цветов RGB из корневого контроллера должны передаться контроллеру со слайдерами
 5) (3 балла) Передача параметров из последующего контроллера в корневой. Значения цветов RGB из контроллера со слайдерами должны передаться корневому контроллеру
 */

import UIKit

class ViewController: UIViewController {

    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view.
    }


}

